#pragma once
#include <Windows.h>

///////////=====================================二进制相关=================================////////////////////
//特征码搜索
DWORD Bin_Search(BYTE * pSourceArrary, DWORD dwSourceLen, BYTE *pTargetArray, DWORD dwTargetLen);



///////////=====================================字符串相关=================================////////////////////
//判断str1是否以str2结束
int Str_IsEndWith(const char *str1, char *str2);



///////////=====================================进程相关=================================////////////////////